import Link from "next/link"
import Styles from "@/app/page.module.css"

// export default function History() {
//     return (
//         <div>
//             <nav className="container">
//                 <h1 className="simbol">تاریخچه قهوه</h1>
//                 <ul className="Mother-list">

// <li><h3>منشأ قهوه</h3>
//     قهوه یکی از محبوب‌ترین نوشیدنی‌های جهان است که قدمتی چندین قرنی دارد. گفته می‌شود که اولین کشف قهوه در قرن نهم میلادی در اتیوپی توسط یک چوپان به نام «کالدی» رخ داده است. او متوجه شد که بزهایش پس از خوردن نوعی دانه خاص انرژی بیشتری دارند</li>

// {/* <li><h3>گسترش قهوه به خاورمیانه</h3>
//     قهوه به سرعت از اتیوپی به شبه‌جزیره عربستان گسترش یافت و در آنجا کشت و مصرف آن رونق گرفت. شهر مکه یکی از اولین مراکزی بود که قهوه به عنوان نوشیدنی در قهوه‌خانه‌ها عرضه می‌شد. قهوه‌خانه‌ها به مراکزی برای تجمع اجتماعی، گفتگو و تبادل نظر تبدیل شدند
// </li> */}

//                     <li><h3>ورود قهوه به اروپا</h3>
//                         در قرن ۱۷ میلادی، قهوه از طریق بازرگانان ونیزی به اروپا رسید. ابتدا با مقاومت مذهبی روبرو شد، اما پس از تأیید پاپ کلمنت هشتم، قهوه به سرعت در سراسر اروپا محبوب شد و قهوه‌خانه‌ها در شهرهای بزرگ از جمله ونیز، لندن و پاریس شروع به فعالیت کردند
//                     </li>

//                     <li><h3>تأثیر قهوه در انقلاب صنعتی</h3>
//                         در طول انقلاب صنعتی، قهوه به عنوان منبع انرژی برای کارگران و روشنفکران نقش مهمی ایفا کرد. این نوشیدنی نه تنها به عنوان یک محرک فیزیکی، بلکه به عنوان یک محرک ذهنی نیز شناخته شد
//                     </li>

// <li> <h3>قهوه در دنیای مدرن</h3>
//     امروزه قهوه به یک صنعت جهانی تبدیل شده است. کشورهایی مانند برزیل، ویتنام و کلمبیا از بزرگ‌ترین تولیدکنندگان قهوه در جهان هستند. قهوه‌خانه‌ها همچنان به عنوان مراکز اجتماعی و فرهنگی محبوبیت دارند و انواع مختلفی از قهوه از اسپرسو گرفته تا کاپوچینو در دسترس است
// //                     </li>
//                 </ul>
//             </nav>
//         </div>
//     )
// }

export default function History() {
    return (
        <div>
            <nav className="container">
                <h1 className="simbol">تاریخچه قهوه</h1>
                <ul className="mother-list">
                    {historyData.map((item, index) => (
                        <li key={index}>
                            <img src={item.Image} alt="" />
                            <h3>{item.title}</h3>
                            <p>{item.content}</p>

                        </li>
                    ))}
                </ul>
            </nav>
        </div>
    );
}

const historyData = [
    {
        title: "قهوه در دنیای مدرن",
        content: "      امروزه قهوه به یک صنعت جهانی تبدیل شده است. کشورهایی مانند برزیل، ویتنام و کلمبیا از بزرگ‌ترین تولیدکنندگان قهوه در جهان هستند. قهوه‌خانه‌ها همچنان به عنوان مراکز اجتماعی و فرهنگی محبوبیت دارند و انواع مختلفی از قهوه از اسپرسو گرفته تا کاپوچینو در دسترس است",
        Image: "/image/Modern-Universe.jpg"
    }
    ,
    {
        title: "تأثیر قهوه در انقلاب صنعتی",
        content: "    در طول انقلاب صنعتی، قهوه به عنوان منبع انرژی برای کارگران و روشنفکران نقش مهمی ایفا کرد. این نوشیدنی نه تنها به عنوان یک محرک فیزیکی، بلکه به عنوان یک محرک ذهنی نیز شناخته شد",
        Image: "/image/Revelotin.jpg"
    }
    ,
    {
        title: "ورود قهوه به اروپا",
        content: "     در قرن ۱۷ میلادی، قهوه از طریق بازرگانان ونیزی به اروپا رسید. ابتدا با مقاومت مذهبی روبرو شد، اما پس از تأیید پاپ کلمنت هشتم، قهوه به سرعت در سراسر اروپا محبوب شد و قهوه‌خانه‌ها در شهرهای بزرگ از جمله ونیز، لندن و پاریس شروع به فعالیت کردند",
        Image: "/image/Europe.jpg"
    }
    ,
    {
        title: "گسترش قهوه به خاورمیانه",
        content: "             قهوه به سرعت از اتیوپی به شبه‌جزیره عربستان گسترش یافت و در آنجا کشت و مصرف آن رونق گرفت. شهر مکه یکی از اولین مراکزی بود که قهوه به عنوان نوشیدنی در قهوه‌خانه‌ها عرضه می‌شد. قهوه‌خانه‌ها به مراکزی برای تجمع اجتماعی، گفتگو و تبادل نظر تبدیل شدند",
        Image: "/image/Middle-east.jpg"
    }
    ,
    {
        title: "منشأ قهوه",
        content: " قهوه یکی از محبوب‌ترین نوشیدنی‌های جهان است که قدمتی چندین قرنی دارد. گفته می‌شود که اولین کشف قهوه در قرن نهم میلادی در اتیوپی توسط یک چوپان به نام «کالدی» رخ داده است. او متوجه شد که بزهایش پس از خوردن نوعی دانه خاص انرژی بیشتری دارند ",
        Image: "/image/Start.jpg"
    },
];
