import Link from "next/link"
import Styles from "@/app/page.module.css"

export default function Benefits() {

    return (
        <div>
            <nav className="containerB">
                <h1 className="simbol">خواص قهوه چیست؟ – ۱۵ خاصیت و فایده کم نظیر که باید بدانید</h1>

                <div className="mini-simbol">
                    <img src={'/image/Cappuccino-Coffee.jpg'} alt="" />
                    <h3 >اگر شما هم یکی از آن افرادی هستید که نمی‌توانید زندگی را بدون قهوه صبحگاهی را تصور کنید، خبر خوبی برایتان داریم. قهوه نه‌تنها یک نوشیدنی بسیار خوش‌طعم و انرژی‌بخش است، بلکه لیستی بلند بالا از مزایا را برای سلامتی شما به همراه می‌آورد، از کاهش خطر بیماری‌های قلب و عروق و کبد گرفته تا سرطان و دیابت نوع ۲. بله درست خواندید! فنجان قهوه بی‌ادعای شما انبوه ترکیبات مختلفی مانند آنتی‌اکسیدان‌ها را در خود جای داده که با رادیکال‌های آزاد و بیماری‌ها مقابله کرده و از التهاب‌ها می‌کاهند. اما خواص قهوه به همین موارد محدود نشده و در ادامه ۱۵ خاصیت مختلف قهوه را مرور خواهیم کرد.</h3>
                </div>

                <ul className="mother-list">
                    {Benefitdata.map((item, index) => (
                        <li key={index}>
                            <h3>{item.title}</h3>
                            <img src={item.Image} alt="" />
                            <p>{item.content}</p>
                        </li>
                    ))}
                </ul>
            </nav>
        </div>
    )
}

const Benefitdata = [
    {
        Id: 1,
        title: "۱. افزایش سطح انرژی",
        content: "قهوه آکنده‌ از ماده محرک معروف به نام کافئین است. وقتی کافئین را در مقادیر معقول مصرف می‌کنید، سوخت‌وساز بدن بالا می‌رود، آدرنالین و هورمونی در مغز که مسئولیت آزادسازی انرژی را برعهده دارد، آزاد می‌شود. قهوه ضمنا می‌تواند با از کار انداختن «آدنوزین» احساس خستگی را به صورت موقتی از بین ببرد. آدنوزین یک محرک سیستم عصبی مرکزی است که فعالیت‌های اعصاب را کاهش می‌دهد و منجر به شکل‌گیری احساس خستگی می‌شود. ضمنا با نوشیدن قهوه، ترشح «دوپامین» هم افزایش می‌یابد که هورمون «خوشحالی» مغز به حساب می‌آید. بله، یکی از عوارض جانبی و خواص قهوه، خوشحالی بیشتر است!",
        Image: "/image/Benefits/1.jpg"
    },

    {
        Id: 2,
        title: "۲. کاهش چربی بدن و کمک به تناسب اندام",
        content: "کافئین به تناسب اندام هم کمک می‌کند،‌ چون با یاری رساندن به روده و ایجاد تغییرات در ذخایر چربی، ریسک ابتلا به مشکلات مختلفی که به اضافه‌وزن مربوط می‌شوند، مانند مشکلات قلبی، را کاهش می‌دهد. پژوهشگران دریافته‌اند آن‌هایی که مقادیر بیشتری از قهوه را به صورت مداوم مصرف می‌کنند، خصوصا در میان آقایان، سطوح چربی کمتری در بدن خود دارند."
        ,
        Image: "/image/Benefits/2.jpg"
    },

    {
        Id: 3,
        title: "۳. افزایش فعالیت‌های فیزیکی",
        content: "پژوهشگران متوجه این نکته هم شده‌اند که میان مصرف قهوه و میزان فعالیت‌های ورزشی، ارتباطی مستقیم وجود دارد. زنانی که در روز یک یا دو لیوان قهوه می‌نوشند، ۱۷ درصد شانس بیشتر برای رسیدن به سطح فعالیت‌های فیزیکی پیشنهادی در روز برای سلامتی خود را دارند.",
        Image: "/image/Benefits/3.jpg"
    },

    {
        Id: 4,
        title: "۴. کاهش ریسک دیابت نوع دو",
        content: 'دیابت نوع ۲ نوعی بیماری مزمن است که بر نحوه استفاده بدن از قند تاثیر می‌گذارد. زمانی که قند خون بالا می‌ماند، ممکن است شاهد بروز مشکلاتی جدی در بدن باشیم. نوشیدن قهوه اما می‌تواند خطر ابتلا به این بیماری را کاهش دهد. با مقایسه افرادی که ۵ لیوان قهوه در روز می‌نوشند با افرادی که عملا مصرف قهوه ندارند، پژوهشگران دریافتند که گروه دوم بیشتر در معرض این بیماری قرار می‌گیرند.جالب این‌که فرقی هم ندارد قهوه مصرفی شامل کافئین‌دار باشد یا بدون کافئین. قهوه به طور کلی از کارکرد سلول‌های بتا در لوزالمعده که کارشان تولید انسولین مورد نیاز بدن است محافظت می‌کند. در نهایت این را هم باید افزود که قهوه حاوی منیزیم است که به بدن در شکستن سلول‌های قند یاری می‌رساند.'
        ,
        Image: "/image/Benefits/4.jpg"

    },

    {
        Id: 5,
        title: "۵. کاهش ریسک بیماری‌های کبد",
        content: "بیماری‌های کبدی آسیب‌هایی جدی به بدن‌تان وارد کرده و پیچیدگی‌هایی مانند سیروز کبدی پدید می‌آورند که جان را به خطر می‌اندازند. با این حال به نظر می‌رسد که قهوه قادر به کمک به سلامت کبد است. محققان می‌گویند یک لیوان قهوه در روز می‌تواند ریسک مرگ به خاطر بیماری‌های مزمن کبدی را تا ۱۵ درصد کاهش دهد. خبر خوب برای عاشقان قهوه این‌که با نوشیدن چهار لیوان قهوه در روز، این رقم به ۷۱ درصد می‌رسد."
        ,
        Image: "/image/Benefits/5.jpg"
    },

    {
        Id: 6,
        title: "۶. کاهش ریسک ابتلا به آلزایمر",
        content: "بیماری آلزایمر نوعی اختلال مغزی پیش‌رونده است که باعث از دست رفتن حافظه و اختلال در افکار می‌شود. در حال حاضر هیچ درمانی برای این بیماری وجود ندارد، اما شناسایی و رسیدگی زودهنگام می‌تواند پیشرفت آن را کند سازد. محققان در پژوهشی بزرگ با مشارکت ۲۹ هزار نفر دریافتند که هر چه قهوه بیشتری مصرف کنید، کمتر در خطر پیشرفت بیماری آلزایمر خواهید بود."
         ,
        Image: "/image/Benefits/6.jpg"
    },

    {
        Id: 7,
        title: "۷. کاهش ریسک ابتلا به پارکینسون",
        content: "بیماری پارکینسون هم شرایط عصب‌شناختی پیش‌رونده و به‌خصوصی را رقم می‌زند که شخص را از نظر حرکت و حفظ تعادل دچار مشکل می‌کند. درست مانند آلزایمر، هیچ درمانی برای این بیماری وجود ندارد. با این حال به نظر می‌رسد آن‌هایی که به صورت مداوم قهوه می‌نوشند کمتر در معرض خطر پارکینسون هستند و اساسا با مصرف قهوه سرعت پیشروی بیماری کند می‌شود." ,
        Image: "/image/Benefits/7.jpg"
    },

    {
        Id: 8,
        title: "۸. بهبود سلامت قلب",
        content: "یکی دیگر از خواص قهوه این است که می‌تواند از شما در برابر بیماری‌های قلبی محافظت و در مجموع به سلامت قلب کمک کند. بیماری‌های قلبی و عروقی یکی از اصلی‌ترین علل مرگ‌ومیر در سراسر جهان به حساب می‌آیند. پژوهش‌ها نشان می‌دهد آن‌هایی که روزانه سه الی پنج لیوان قهوه می‌نوشند، به احتمال ۱۵ درصد کمتر با بیماری‌های قلبی و همین‌طور ایست قلبی مواجه خواهند شد. از سوی دیگر قهوه امکان کاهش فشار خون را هم ایجاد می‌کند." ,
        Image: "/image/Benefits/8.jpg"
    },

    {
        Id: 9,
        title: "۹. بهبود سلامت اسپرم",
        content: "پژوهشی در سال ۲۰۰۹ میلادی نشان داد که میانگین جنبندگی اسپرم، همگام با میزان مصرف قهوه افزایش می‌یابد. مردانی که حتی در روز شش لیوان قهوه می‌نوشند، جنبندگی اسپرم بالاتری نسبت به آن‌هایی دارند که قهوه مصرف نمی‌کنند. به طور کلی می‌توان گفت یکی از فواید قهوه برای مردان احتمال کاهش خطر ابتلا به سرطان پروستات است." ,
        Image: "/image/Benefits/9.jpg"
    },

    {
        Id: 10,
        title: "۱۰. بهبود سلامت پوست",
        content: "قهوه حتی برای پوست شما هم مفید است. دانه قهوه حاوی کافئین و اسیدهای کلروژنیک است که خواص ضد التهاب و ضد میکروبی داشته و می‌توانند از شما در برابر آفتاب‌سوختگی محافظت کنند. با مالیدن قهوه مایع یا پودر قهوه به پوست ممکن است قادر به کمک به برخی ناهنجاری‌های پوستی مانند اگزما، پسوریازیس و آکنه باشید." ,
        Image: "/image/Benefits/10.jpg"
    },

    {
        Id: 11,
        title: "۱۱. بهبود تنوع میکروبیوم",
        content: "میکروبیوم معده و روده شما از تریلیون‌ها میکرو ارگانیسم مختلف تشکیل شده است و متخصصان می‌گویند با داشتن میکروبیومی متنوع، به سطوح بالاتری از سلامت دست خواهید یافت. این موضوع عمدتا راجع به افرادی که قهوه می‌نوشند مصداق دارد. یکی از نظریه‌ها هم این است که مصرف فیبر محلول و خواص پری‌بیوتیک موجود در قهوه باعث تغذیه بهتر میکرو ارگانیسم‌ها خواهد شد.",
        Image: "/image/Benefits/11.jpg"
    },

    {
        Id: 12,
        title: "۱۲. کاهش ریسک ابتلا به بیماری‌ سنگ کیسه صفرا",
        content: "نوشیدن قهوه احتمالا خطر شکل‌گیری سنگ کیسه صفرا را هم در آینده‌تان کاهش دهد. پژوهشی که به تازگی انجام شده نشان می‌دهد با نوشیدن حداقل ۶ لیوان قهوه در روز، می‌توان از بروز نشانه‌های بیماری سنگ کیسه صفرا جلوگیری کرد. البته اگر همین حالا به این بیماری دچار هستید، لازم است از نوشیدن قهوه اجتناب کنید، چرا که باعث تحریک کیسه صفرا می‌شود.",
        Image: "/image/Benefits/12.jpg"
    },

    {
        Id: 13,
        title: "۱۳. درمان سلول‌های آسیب‌دیده",
        content: "آنتی‌اکسیدان‌ها نه‌تنها از آسیب دیدن سلول‌ها جلوگیری می‌کنند، بلکه به درمان آن‌ها و بهبود مشکلات ژنتیکی در سراسر بدن‌تان هم تا حدودی کمک می‌کند. پژوهش‌ها نشان داده قهوه منبعی سرشار از پلی‌فنول است. پلی فنول نوعی آنتی‌اکسیدان است که به باکتری‌های «خوب» بدن شما سوخت‌رسانی می‌کند. یکی از پلی‌فنول‌های موجود در قهوه، اسید کلروژنیک نام دارد.باور محققان بر این است که اسید کلروژنیک می‌تواند به کاهش خطرات ناشی از گستره وسیعی از مشکلات از جمله سرطان، دیابت و چاقی کمک می‌کند. از دیگر منابع پلی‌فنول‌ می‌توان به میوه‌ها، سبزیجات و غلات کامل اشاره کرد، هرچند که بسیاری از مردم جهان به اندازه کافی این خوراکی‌ها را مصرف نمی‌کنند.",
        Image: "/image/Benefits/13.jpg"
    },

    {
        Id: 14,
        title: "۱۴. کاهش التهاب",
        content: "التهاب پاسخی طبیعی بدن به بروز آسیب یا عفونت است. با این حال اگر برای مدتی طولانی ادامه پیدا کند، آن هم وقتی خبری از هیچ‌گونه آسیب یا عفونتی نیست، مشکلاتی برای سلامتی پدید خواهد آمد که به آن التهاب مزمن می‌گویند. محققان تا به امروز متوجه شده‌اند که میان التهاب مزمن و ابتلا به بیماری‌های قلبی و دیابت نوع ۲، ارتباطاتی وجود دارد. رژیم غذایی، فعالیت‌های فیزیکی و سطح استرس، همگی از جمله عواملی هستند که میزان التهاب مزمن را در بدن شما تعیین می‌کنند. برخی محققان عقیده دارند که قهوه به کاهش التهاب کمک می‌کند اما این موضوع هم‌چنان جای بررسی هرچه بیشتر دارد.",
        Image: "/image/Benefits/14.jpg"
    },

    {
        Id: 15,
        title: "۱۵. کاهش احتمالی ریسک افسردگی",
        content: "پژوهشگران این را هم دریافته‌اند افرادی که حداقل ۴ لیوان قهوه در روز می‌نوشند نسبت به آن‌هایی که کمتر از یک لیوان می‌نوشند، به شکل قابل‌توجهی در معرض خطر افسردگی پایین‌تری قرار دارند. البته که پژوهش‌ها تاکنون صرفا شهودی بوده‌اند و بنابراین نمی‌توان علت و معلول را به شکلی دقیق بررسی کرد. برای مثال ممکن است آن‌هایی که افسردگی ندارند به احتمال بیشتری به نوشیدن قهوه روی بیاورند و این قهوه نباشد که خطر افسردگی را مستقیما کاهش می‌دهد.",
        Image: "/image/Benefits/15.jpg"
    },
];